
&НаСервере
Процедура СоздатьСтоДокументовНаСервере()
	Счетчик = 0;
	а = 100;
	Пока Счетчик <= а Цикл;
		Счетчик = Счетчик +1;
		
		ДокНакл = Документы.ПриходнаяНакладная.СоздатьДокумент();
		ДокНакл.Дата = ТекущаяДата();
		ДокНакл.Склад = Справочники.Склады.Основной;
		//Для документа ПриходнаяНакладная
		Товар = ДокНакл.Материалы.Добавить();
		Товар.Материал = Справочники.Номенклатура.НайтиПоКоду("000000005");
		Товар.Цена = 10;
		Товар.Количество = Счетчик;
		Товар.Сумма = Товар.Цена * Товар.Количество;
		ДокНакл.Записать(РежимЗаписиДокумента.Проведение);
				
		//Для документа ОказаниеУслуги 
		ДокУсл = Документы.ОказаниеУслуги.СоздатьДокумент();
        ДокУсл.Дата = ТекущаяДата();
		ДокУсл.Склад = Справочники.Склады.Основной;
		ДокУсл.Клиент = Справочники.Клиенты.НайтиПоКоду("000000001");
		ДокУсл.Мастер = Справочники.Сотрудники.НайтиПоКоду("000000002");
		
		Товар = ДокУсл.ПереченьНоменклатуры.Добавить();
		Товар.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000005");
		Товар.Цена = 10;
		Товар.Количество = Счетчик;
		Товар.Сумма = Товар.Цена * Товар.Количество;

		Услуга = ДокУсл.ПереченьНоменклатуры.Добавить();
		Услуга.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000011");
		Услуга.Цена = 100;
		Услуга.Стоимость = 50;  
		Услуга.Количество = Счетчик;
		Услуга.Сумма = (Услуга.Цена + Услуга.Стоимость) * Услуга.Количество; 
		
		ДокУсл.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтоДокументов(Команда)
	СоздатьСтоДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтоДокументовОказаниеУслугиНаСервере()
	Счетчик = 0;
	а = 100;
	Пока Счетчик <= а Цикл;
		Счетчик = Счетчик +1;
		
		ДокУсл = Документы.ОказаниеУслуги.СоздатьДокумент();
		ДокУсл.Дата = ТекущаяДата();
		ДокУсл.Склад = Справочники.Склады.Основной;
		ДокУсл.Клиент = Справочники.Клиенты.НайтиПоКоду("000000001");
		ДокУсл.Мастер = Справочники.Сотрудники.НайтиПоКоду("000000002");
		
		Товар = ДокУсл.ПереченьНоменклатуры.Добавить();
		Товар.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000005");
		Товар.Цена = 10;
		Товар.Количество = Счетчик;
		Товар.Сумма = Товар.Цена * Товар.Количество;
		
		Услуга = ДокУсл.ПереченьНоменклатуры.Добавить();
		Услуга.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("000000011");
		Услуга.Цена = 100;
		Услуга.Стоимость = 50;  
		Услуга.Количество = Счетчик;
		Услуга.Сумма = (Услуга.Цена + Услуга.Стоимость) * Услуга.Количество; 
		
		ДокУсл.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура СтоДокументовОказаниеУслуги(Команда)
	СтоДокументовОказаниеУслугиНаСервере();
КонецПроцедуры
