&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении()
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦенаДата(
	Объект.Дата, СтрокаТабличнойЧасти.Номенклатура, Объект.Склад);
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры