
&НаСервере
Процедура ЗаполнитьНаСервере()
	Выборка = Документы.ОказаниеУслуги.Выбрать();
	Пока Выборка.Следующий() Цикл
	НоваяСтрока = ТабличнаяЧасть.Добавить();
	НоваяСтрока.Документ =  Выборка.Ссылка;	
		
	КонецЦикла
КонецПроцедуры 

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьПриАктивизацииСтрокиНаСервере(Ссылка, Склад, Клиент, Мастер);
	Склад = Ссылка.Склад;
	Клиент = Ссылка.Клиент;
	Мастер = Ссылка.Мастер;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриАктивизацииСтроки(Элемент)
	ТабличнаяЧастьПриАктивизацииСтрокиНаСервере(Элементы.ТабличнаяЧасть.ТекущиеДанные.ТабличнаяЧастьДокумент, Склад, Клиент, Мастер);
КонецПроцедуры