  &НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры  &НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

  &НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("подкл_ОповещениеИзмененияКомментария", ЭтаФорма);
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаВводаКомментария",, ЭтаФорма,,,,Оповещение);
	
	a = 1;   
КонецПроцедуры

  &НаКлиенте
Процедура подкл_ОповещениеИзмененияКомментария(Результат, ДополнительныеПараметры) Экспорт  
	
	Если НЕ Результат = Неопределено Тогда 
	Объект.Комментарий = Результат; 
	КонецЕсли;
КонецПроцедуры                                                                     