  &НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры  &НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

  &НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("подкл_ОповещениеИзмененияКомментария", ЭтаФорма);
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("ЗаполненныйКомментарий", Объект.Комментарий); 
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаВводаКомментария",ПараметрыНовойФормы, ЭтаФорма,,,,Оповещение);
	a = 1;   
КонецПроцедуры

  &НаКлиенте
Процедура подкл_ОповещениеИзмененияКомментария(Результат, ДополнительныеПараметры) Экспорт  
	
	Если НЕ Результат = Неопределено Тогда 
	Объект.Комментарий = Результат; 
	КонецЕсли;
КонецПроцедуры                                                                     

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Склад.ЗапретОприходования = Истина 
		И ТекущийОбъект.Склад.ДатаЗапретаОприходования <= ТекущийОбъект.Дата Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для данного склада запрещено создавать приходные накладные!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Для каждого Строка Из ТекущийОбъект.Материалы Цикл
    Если Строка.Материал.ЗапретОприходования = Истина
    И Строка.Материал.ДатаЗапретаОприходования <= ТекущийОбъект.Дата Тогда
      Отказ = Истина;
      Сообщение = Новый СообщениеПользователю;
      Сообщение.Текст = "Для номенклатуры """ + Строка.Материал + """ запрещено оприходование!";
      Сообщение.Сообщить();
    КонецЕсли;
    КонецЦикла;
  КонецПроцедуры 