  &НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры  &НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

  &НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("подкл_ОповещениеИзмененияКомментария", ЭтаФорма);
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("ЗаполненныйКомментарий", Объект.Комментарий); 
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаВводаКомментария",ПараметрыНовойФормы, ЭтаФорма,,,,Оповещение);
	a = 1;   
КонецПроцедуры

  &НаКлиенте
Процедура подкл_ОповещениеИзмененияКомментария(Результат, ДополнительныеПараметры) Экспорт  
	
	Если НЕ Результат = Неопределено Тогда 
	Объект.Комментарий = Результат; 
	КонецЕсли;
КонецПроцедуры                                                                     

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Склад.ЗапретОприходования = Истина Тогда
		Отказ = Истина; 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для данного склада создание приходных накладных запрещено!";
		Сообщение.Сообщить();	
	КонецЕсли;
	Если ТекущийОбъект.Склад.ДатаЗапретаОприходования <= Объект.Дата Тогда 
		Отказ = ТекущийОбъект.Склад.ДатаЗапретаОприходования <= Объект.Дата;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Невозможно создание приходной накладной в указанную дату!";
		Сообщение.Сообщить();	
	КонецЕсли; 
	Если ТекущийОбъект.Склад.ЗапретОприходования = Истина и ТекущийОбъект.Склад.ДатаЗапретаОприходования = 0 Тогда
		Отказ = Истина;
		Отказ = 0;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено поле (Дата запрета оприходования)";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры 